arr1 = [
    "веб-скрапинг",
    "выгрузка",
    "извлечение данных",
    "мониторинг",
    "парсер",
    "парсинг",
    "сбор данных",
    "сбор",
    "скрапинг",
]

arr2 = [
    "aliexpress",
    "amazon",
    "bing",
    "chatgpt",
    "copilot",
    "duckduckgo",
    "ebay",
    "gemini",
    "google maps",
    "google trends",
    "google",
    "instagram",
    "perplexity",
    "rambler",
    "telegram",
    "wildberries",
    "yahoo",
    "yandex maps",
    "yandex market",
    "yandex wordstat",
    "yandex",
    "youtube",
]

for i1 in arr1:
    for i2 in arr2:
        print(f"{i1} {i2}")

#  сопутствующие задачи
    #  - очистка данных
    #  - структурирование данных
    #  - api для парсинга
    #  - прокси для парсинга


#  SEO и Веб-мастера (Парсинг выдачи и аудит)
    #  - анализ обратных ссылок (через парсинг сервисов типа Ahrefs/Semrush)
    #  - мониторинг позиций конкурентов
    #  - парсинг картинок из выдачи
    #  - поиск дроп-доменов
    #  - проверка индексации страниц
    #  - проверка позиций
    #  - сбор поисковых подсказок
    #  - сбор семантики
    #  - сбор сниппетов

#  E-commerce и Ритейл (Мониторинг цен и товаров)
#  Самые денежные клиенты. Им нужно знать, что делают конкуренты.
#  Кейсы по конкретным нишам: одежда, электроника, автозапчасти.
    #  - мониторинг цен конкурентов (Wildberries, Ozon, Amazon)
    #  - отслеживание остатков на складах
    #  - парсинг характеристик товаров для наполнения своего магазина
    #  - парсинг цен на авиабилеты или отели
    #  - сбор отзывов о товарах

#  Маркетинг и Лидогенерация (Сбор контактов)
#  B2B сектор, которому нужны базы для рассылок и звонков.
    #  - парсинг Telegram-чатов и групп
    #  - парсинг контактов с Google Maps / 2ГИС
    #  - поиск рекламных объявлений конкурентов
    #  - сбор e-mail с сайтов
    #  - сбор баз Whois (дата регистрации домена)

#  Технический парсинг и Proxy
#  Для продвинутых пользователей.
    #  - использование API A-Parser для своих скриптов
    #  - как обходить Cloudflare
    #  - парсинг JS-сайтов (через Headless браузеры)
    #  - проверка валидности баз ссылок
    #  - работа с мобильными прокси
    #  - чекеры прокси

#  Кейсы и Анти-кейсы (Социальное доказательство)
#  Демонстрация того, как парсинг сэкономил деньги или принес прибыль.
    #  - «Автоматизация наполнения сайта на WP через парсинг»
    #  - «Как мониторинг цен помог увеличить прибыль на 20%»
    #  - «Как мы собрали базу из 100к товаров за час»
